## 🧾 Terraform Plan for `sec_secretmanager_baseline`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.advanced_secret.aws_cloudwatch_metric_alarm.secret_access_alarm[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "secret_access_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:123456789012:SecretAlerts",
        ]
      + alarm_description                     = "Alarm triggered on secret access frequency."
      + alarm_name                            = "my-secret-advanced-access-alert"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "GetSecretValue"
      + namespace                             = "AWS/SecretsManager"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "missing"
    }

  # module.advanced_secret.aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-secret-advanced-lambda-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.advanced_secret.aws_iam_role_policy_attachment.lambda_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "my-secret-advanced-lambda-exec-role"
    }

  # module.advanced_secret.aws_kms_alias.secrets_key_alias will be created
  + resource "aws_kms_alias" "secrets_key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/secretsmanager-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.advanced_secret.aws_kms_key.secrets_encryption will be created
  + resource "aws_kms_key" "secrets_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for Secrets Manager encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.advanced_secret.aws_lambda_function.secret_rotation_lambda[0] will be created
  + resource "aws_lambda_function" "secret_rotation_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./lambda_rotation_function.zip"
      + function_name                  = "my-secret-advanced-rotation"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "hGWjSDO1UNV30UPiBrLs0/pGRZ52dKdxyVCD3I55Rig="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST" = "db.example.com"
            }
        }
    }

  # module.advanced_secret.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Production database password"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "my-secret-advanced"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
        }
    }

  # module.advanced_secret.aws_secretsmanager_secret_rotation.rotation[0] will be created
  + resource "aws_secretsmanager_secret_rotation" "rotation" {
      + id                  = (known after apply)
      + rotation_enabled    = (known after apply)
      + rotation_lambda_arn = (known after apply)
      + secret_id           = (known after apply)

      + rotation_rules {
          + automatically_after_days = 15
        }
    }

  # module.basic_secret.aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-secret-basic-lambda-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.basic_secret.aws_iam_role_policy_attachment.lambda_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "my-secret-basic-lambda-exec-role"
    }

  # module.basic_secret.aws_kms_alias.secrets_key_alias will be created
  + resource "aws_kms_alias" "secrets_key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/secretsmanager-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.basic_secret.aws_kms_key.secrets_encryption will be created
  + resource "aws_kms_key" "secrets_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for Secrets Manager encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.basic_secret.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "my-secret-basic"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->